Autodesk.Revit.DB.RepeatingReferenceSource.GetReference(Autodesk.Revit.DB.RepeaterCoordinates)
Returns an individual repeating reference given by coordinates in the array, or null if there is no reference at the coordinates (for example if there is a hole in a divided surface.)
Remarks:
The coordinates must be within the bounds of the repeating reference source.
coordinates:
The coordinates in the array of repeating references.
Returns:
The repeating reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The coordinates are not valid for the repeating reference source. This could be because of a mismatched dimensionality or because the coordinates are outside the bounds of the repeating reference source.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The repeating reference source is no longer valid.
Since:
2014

Autodesk.Revit.DB.RepeatingReferenceSource.GetDefaultRepeatingReferenceSource(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns the default repeating reference source for a given element.
Remarks:
The element must support repeating references. Use HasRepeatingReferenceSource() to find out whether an element has any repeating references.
document:
The document that contains the element.
elementId:
The id of the element.
Returns:
The default repeating reference source of the given element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
The element does not have any repeating reference sources.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.RepeatingReferenceSource.HasRepeatingReferenceSource(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Determines whether an element has any repeating reference sources that can be used when creating component repeaters.
document:
The document that contains the element.
elementId:
The id of the element.
Returns:
True if the element has any repeating reference sources.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014